Вот подборка задач на **условия (`if`, `switch`)** и **циклы (`for`, `while`, `do-while`)** в C#. Я разбил их на уровни сложности. Для каждой задачи есть условие, а в конце — эталонные решения.

### Уровень 1: Базовый (Условные операторы + for)

**Задача 1. Чет или нечет?**
Напишите программу, которая запрашивает у пользователя целое число и выводит:
*   "Четное", если число делится на 2.
*   "Нечетное", если не делится.
*   Если число отрицательное, программа должна вывести "Отрицательное" (при этом четность проверять не нужно).

**Задача 2. Таблица умножения (цикл for)**
Выведите на экран таблицу умножения для числа `N` (от 1 до 10), где `N` вводит пользователь.
Пример для N = 3:
```text
3 x 1 = 3
3 x 2 = 6
...
3 x 10 = 30
```

---

### Уровень 2: Средний (Вложенные условия, while, do-while)

**Задача 3. Калькулятор с проверкой (switch + do-while)**
Создайте простой калькулятор, который работает в цикле, пока пользователь не введет команду выхода `exit`.
Пользователь вводит два числа и оператор (`+`, `-`, `*`, `/`).
*   Используйте `switch` для выбора действия.
*   При делении на 0 выводите ошибку "Деление на ноль!".
*   Программа должна спрашивать: "Хотите продолжить? (y/n)", прежде чем завершиться или продолжить.

**Задача 4. Сумма чисел до нуля (while)**
Напишите программу, которая запрашивает у пользователя числа, пока он не введет `0`.
Программа должна вывести сумму **всех положительных чисел**, которые были введены. Отрицательные числа игнорируются (не суммируются), но цикл продолжается.

---

### Уровень 3: Продвинутый (Логика, вложенные циклы)

**Задача 5. Простое число**
Напишите функцию (или программу), которая проверяет, является ли введенное число простым.
*   Простое число — это число, которое делится только на 1 и само на себя.
*   Подсказка: достаточно проверить делители от 2 до квадратного корня из числа (`Math.Sqrt`).
*   Учтите, что числа 0 и 1 не являются простыми.

**Задача 6. Золотая рыбка (Цикл в цикле)**
Нарисуйте в консоли прямоугольный треугольник звездочками высотой `H` (H вводит пользователь).
*   Если H = 5, вывод должен быть таким:
```text
*
**
***
****
*****
```
*   **Усложнение:** Сделайте зеркальный вариант (треугольник прижат к правому краю).

---

### Уровень 4: Звездные задачи (Комбинация всего)

**Задача 7. Угадай число**
Компьютер загадывает случайное число от 1 до 100 (`Random rand = new Random(); int secret = rand.Next(1, 101);`).
Пользователь пытается его угадать. Программа подсказывает: "Больше" или "Меньше".
*   Считайте количество попыток.
*   Когда пользователь угадает, выведите: "Поздравляю! Вы угадали за X попыток!".
*   Если пользователь вводит число вне диапазона 1-100, программа должна сказать "Вне диапазона!" и не засчитывать это как попытку.

---

### Эталонные решения
Задача 1
```C#
Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine());

if (num < 0)
{
    Console.WriteLine("Отрицательное");
}
else if (num % 2 == 0)
{
    Console.WriteLine("Четное");
}
else
{
    Console.WriteLine("Нечетное");
}
```
Задача 2
```C#
Console.Write("Введите число N: ");
int n = int.Parse(Console.ReadLine());

for (int i = 1; i <= 10; i++)
{
    Console.WriteLine($"{n} x {i} = {n * i}");
}
```
Задача 3
```C#
string choice;
do
{
    Console.Write("Введите первое число: ");
    double a = double.Parse(Console.ReadLine());
    Console.Write("Введите второе число: ");
    double b = double.Parse(Console.ReadLine());
    Console.Write("Введите оператор (+, -, *, /): ");
    string op = Console.ReadLine();

    double result = 0;
    bool valid = true;

    switch (op)
    {
        case "+": result = a + b; break;
        case "-": result = a - b; break;
        case "*": result = a * b; break;
        case "/":
            if (b == 0) 
            { 
                Console.WriteLine("Ошибка: Деление на ноль!");
                valid = false; 
            }
            else result = a / b;
            break;
        default:
            Console.WriteLine("Неверный оператор");
            valid = false;
            break;
    }

    if (valid) Console.WriteLine($"Результат: {result}");

    Console.Write("Продолжить? (y/n): ");
    choice = Console.ReadLine();
} while (choice == "y" || choice == "Y");
```
Задача 4
```C#
int sum = 0;
int number;

Console.WriteLine("Вводите числа (0 для выхода):");
do
{
    number = int.Parse(Console.ReadLine());
    if (number > 0)
        sum += number;
} while (number != 0);

Console.WriteLine($"Сумма положительных чисел: {sum}");
```
Задача 5
```C#
Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine());

bool isPrime = true;

if (num < 2) 
    isPrime = false;
else
{
    // Проверяем до квадратного корня
    for (int i = 2; i <= Math.Sqrt(num); i++)
    {
        if (num % i == 0)
        {
            isPrime = false;
            break; // Выходим из цикла, так как делитель найден
        }
    }
}

Console.WriteLine(isPrime ? "Простое" : "Составное");
```
Задача 6 
```C#
Console.Write("Введите высоту: ");
int h = int.Parse(Console.ReadLine());

// Левый треугольник
for (int i = 1; i <= h; i++)
{
    for (int j = 1; j <= i; j++)
    {
        Console.Write("*");
    }
    Console.WriteLine();
}

Console.WriteLine("\n--- Зеркальный ---\n");

// Правый треугольник
for (int i = 1; i <= h; i++)
{
    // Сначала пробелы
    for (int j = 1; j <= h - i; j++)
    {
        Console.Write(" ");
    }
    // Потом звезды
    for (int j = 1; j <= i; j++)
    {
        Console.Write("*");
    }
    Console.WriteLine();
}
```
Задача 7
```C#
Random rand = new Random();
int secret = rand.Next(1, 101);
int guess;
int attempts = 0;

Console.WriteLine("Я загадал число от 1 до 100. Попробуй угадать!");

do
{
    Console.Write("Ваш вариант: ");
    guess = int.Parse(Console.ReadLine());

    if (guess < 1 || guess > 100)
    {
        Console.WriteLine("Вне диапазона! Введите число от 1 до 100.");
        continue; // Не засчитываем попытку
    }

    attempts++;

    if (guess < secret)
        Console.WriteLine("Меньше!");
    else if (guess > secret)
        Console.WriteLine("Больше!");
    else
        Console.WriteLine($"Поздравляю! Вы угадали за {attempts} попыток!");

} while (guess != secret);
```